Tekla Open API Reference for Tekla Structures 2025
RadiusDimension.ArcPoint3 Property
 Gets the third arc point.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point ArcPoint3 { get; }
Public ReadOnly Property ArcPoint3 As Point
	Get
Property Value
Type: Point
See Also
Reference
RadiusDimension Class
Tekla.Structures.Drawing Namespace